'''
def max(a,b):
	if a>b:
		return a
	else:
		return b

num1=int(input('输入一个数字：'))
num2=int(input('输入第二个数字：'))
print('{}的数字更大'.format(max(num1,num2)))
_______________________________________________


#使用range()和len()遍历一个序列的索引，打印效果是 0 红   1 黄   2 白  ....
name=['红','黄','白','黑','紫']
for i in range(len(name)):
	print(i,name[i])
——————————————————————————————————————————————————————————	

eat=input('你今天想吃什么？')

if eat=='火锅' or eat=='烧烤':
	print('吃饭去')
else:
	print('不吃了')
——————————————————————————————————————————————————————————————
#for 循环主要用于，对一个范围内的每个元素，进行指定操作

for i in range(1,11):
	print('书桓走的第{}天，想他'.format(i))
____________________________________________________

#while 循环适用于已知循环次数的循环，所又后面跟的是次数或区间，到达指定次数就停止
a=1
while a <= 10:
	print(a)
	a += 1
______________________________________________________

#break 关键字在循环中的作用是：表示停止当前循环
for a in range(1,10):
	if a == 5:
		break
	print(a)
	
	
a=0
while a < 10:
	a += 1
	if a == 5:
		break
	print(a)	
__________________________________________________		
#continue 关键字在循环中的作用是：表示跳过当前循环轮次，去执行下一轮循环
for a in range(1,10):
	if a == 5:
		continue
	print(a)

a = 0
while a < 10:
	a += 1
	if a == 5:
		continue
	print(a)
__________________________________________________________	
'''		

for i in range(0,5):
	print(i)












